tap "buo/cask-upgrade"
tap "denisidoro/tools"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

brew "sqlite"
brew "fnm"
brew "openssl"
brew "coreutils"
brew "nghttp2"
brew "fzf"
brew "gcc"
brew "git"
brew "go"
brew "autojump"
brew "hdf5"
brew "htop"
brew "jq"
brew "make"
brew "mysql"
brew "node"
brew "yarn"
brew "parallel"
brew "shellcheck"
brew "tree"
brew "vim"
brew "watch"
brew "wget"
brew "tig"
brew "bat"
brew "httpie"
brew "gpatch"
brew "pgcli"
brew "opam"
brew "flux"
brew "fswatch"
brew "diff-so-fancy"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

cask "alfred"
cask "enpass"
cask "docker"
cask "firefox"
cask "figma"
cask "tableplus"
cask "google-backup-and-sync"
cask "qlcolorcode"
cask "qlmarkdown"
cask "quicklook-json"
cask "rectangle"
cask "spotify"
cask "telegram"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zoomus"
cask "notion"
cask "kap"
cask "slack"
cask "discord"
cask "cloudflare-warp" # https://1.1.1.1/
cask "centered" # https://www.centered.app/download
cask "monitorcontrol" # https://github.com/MonitorControl/MonitorControl#readme
cask "alt-tab" # https://alt-tab-macos.netlify.app/
cask "insomnia" # https://insomnia.rest/
