tap "buo/cask-upgrade"
tap "denisidoro/tools"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "sqlite"
brew "openssl"
brew "coreutils"
brew "nghttp2"
brew "fzf"
brew "gcc"
brew "git"
brew "go"
brew "hdf5"
brew "htop"
brew "jq"
brew "make"
brew "mysql"
brew "node"
brew "yarn"
brew "parallel"
brew "php@7.2"
brew "shellcheck"
brew "tree"
brew "unrar"
brew "vim"
brew "watch"
brew "wget"
cask "alfred"
cask "docker"
cask "firefox"
cask "google-backup-and-sync"
cask "google-chrome-beta"
cask "qlcolorcode"
cask "qlmarkdown"
cask "quicklook-json"
cask "spectacle"
cask "spotify"
cask "sublime-text-dev"
cask "telegram"
cask "typora"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "zoomus"
